{
  "robot_id": "FetchRobot_head_only",
  "robot_type": "FetchRobot",
  "mobility": {
    "summary": "The Fetch robot is equipped with a differential drive system, as indicated by the presence of left and right wheel links connected via continuous joints to the base link. This design suggests mobility on flat ground and possibly rough terrain, but it does not include any flight capability, stair-climbing mechanisms, or abilities to move between floors autonomously. Therefore, for multi-floor tasks, the robot will require external assistance to traverse different levels."
  },
  "perception": {
    "summary": "Fetch has an articulated head equipped with pan and tilt capabilities, enabling wide-angle perception. Specifically, it includes an RGB camera and a depth camera mounted on the head, providing both visual data and depth information crucial for object detection and manipulation. The height of these sensors varies with the adjustable torso lift, improving its ability to perceive objects at various heights and contribute effectively to cooperative perception tasks and object search and identification.",
    "cameras_info": {
      "head_camera": {
        "height": 1.2000000476837158,
        "type": "fixed"
      }
    }
  },
  "manipulation": {
    "summary": "The robot features a highly articulable arm with seven degrees of freedom, including joints for shoulder pan and lift, continuous rotation for the upper arm and forearm, and revolute joints for the elbow and wrist flexion. This setup, coupled with a prismatic gripper mechanism, allows for versatile and precise manipulation. The arm's extensive reach and adjustability enable it to interact with objects both on high shelves and under tables, making it suitable for complex home arrangement tasks.",
    "arm_workspace": {
      "center": [
        0.14739853143692017,
        0.899940013885498,
        0.1324108988046646
      ],
      "radius": 1.1041796,
      "min_bound": [
        -0.8757104873657227,
        -0.03437389060854912,
        -0.8868222236633301
      ],
      "max_bound": [
        1.0899982452392578,
        1.8497143983840942,
        1.1006197929382324
      ]
    }
  }
}