{
  "robot_id": "FetchRobot_default",
  "robot_type": "FetchRobot",
  "mobility": {
    "summary": "The Fetch robot utilizes a wheeled base with continuous joints for its right and left wheels, making it a ground-based robot primarily suited for flat surfaces. It does not possess the ability to navigate stairs or move between floors autonomously, therefore requiring external assistance for inter-floor travel."
  },
  "perception": {
    "summary": "Fetch is equipped with several sensors for perception. It has a color and depth camera mounted on a pan-tilt head, which allows it to adjust its field of view both horizontally and vertically. The height of the head can be adjusted using the torso lift mechanism, enhancing its ability to perceive objects at different heights and angles. Additionally, a laser sensor is available, possibly for distance measurement and mapping purposes. This array of sensors allows the robot to effectively locate and identify objects in its environment, capturing geometric information necessary for manipulation tasks.",
    "cameras_info": {
      "articulated_agent_arm_camera": {
        "height": 0.7860100000000001,
        "type": "articulated"
      },
      "head_camera": {
        "height": 1.2000000476837158,
        "type": "fixed"
      }
    }
  },
  "manipulation": {
    "summary": "The Fetch robot features a sophisticated manipulator arm with multiple degrees of freedom, including joints that can pan, lift, roll, and flex. The arm has both elbow and wrist joints that provide significant flexibility and reach. The end effector is a gripper with prismatic joints allowing for fine adjustments needed for gripping objects. There is also an articulated camera near the gripper to provide close-up visual feedback during manipulation tasks. The versatile design of the arm allows Fetch to engage in complex manipulation tasks, such as picking and placing objects from high shelves or under tables, accommodating various object sizes and shapes.",
    "arm_workspace": {
      "center": [
        0.14739853143692017,
        0.899940013885498,
        0.1324108988046646
      ],
      "radius": 1.1041796,
      "min_bound": [
        -0.8757104873657227,
        -0.03437389060854912,
        -0.8868222236633301
      ],
      "max_bound": [
        1.0899982452392578,
        1.8497143983840942,
        1.1006197929382324
      ]
    }
  }
}