{
  "robot_id": "FetchRobot_head_only",
  "robot_type": "FetchRobot",
  "mobility": {
    "summary": "The Fetch robot features a differential drive base with continuous joints for both left and right wheels, enabling it to navigate on flat surfaces. This type of base allows for precise linear movements and rotations, making it suitable for indoor environments. It can move across floors to pick and place objects, adhering to tasks requiring cross-floor navigation."
  },
  "perception": {
    "summary": "The Fetch robot is equipped with advanced sensing capabilities. It has a head with pan and tilt joints, allowing the head camera to capture images from various angles. The robot's head camera consists of both RGB and depth sensors, enabling it to perceive geometric details of objects. Additionally, the robot has a fixed laser link for distance measurements, crucial for obstacle avoidance and navigation. These capabilities are essential for searching and perceiving objects for geometric information.",
    "cameras_info": {
      "head_camera": {
        "height": 1.2000000476837158,
        "type": "fixed"
      }
    }
  },
  "manipulation": {
    "summary": "The robot features a highly articulated arm with multiple degrees of freedom, including revolute and continuous joints from the shoulder to the wrist. The end effector includes a gripper with two prismatic joints for gripping objects. These capabilities allow the robot to perform complex manipulation tasks such as object rearrangement and picking from high shelves or under tables. The torso lift joint enables the robot to adjust its height, expanding its operational range.",
    "arm_workspace": {
      "center": [
        0.14739853143692017,
        0.899940013885498,
        0.1324108988046646
      ],
      "radius": 1.1041796,
      "min_bound": [
        -0.8757104873657227,
        -0.03437389060854912,
        -0.8868222236633301
      ],
      "max_bound": [
        1.0899982452392578,
        1.8497143983840942,
        1.1006197929382324
      ]
    }
  }
}