{
  "robot_id": "FetchRobot_default",
  "robot_type": "FetchRobot",
  "mobility": {
    "summary": "FetchRobot has a mobile base equipped with two continuous joints connected to right and left wheels (r_wheel_link and l_wheel_link), allowing it to move on the ground with differential drive capabilities. For cross-floor movement, additional infrastructure like elevators or ramps would be necessary as the robot itself does not feature any vertical mobility mechanism."
  },
  "perception": {
    "summary": "FetchRobot is equipped with multiple sensors, including an RGB camera (head_camera_rgb_frame and head_camera_rgb_optical_frame) and a depth camera (head_camera_depth_frame and head_camera_depth_optical_frame) mounted on a head that can pan and tilt, allowing for extensive environmental scanning and object identification from various angles. Additionally, there is a fixed laser sensor (laser_link) which likely helps in obstacle detection and environment mapping. This setup enables advanced cooperative perception capabilities required for identifying and locating objects before manipulation.",
    "cameras_info": {
      "articulated_agent_arm_camera": {
        "height": 0.7860100000000001,
        "type": "articulated"
      },
      "head_camera": {
        "height": 1.2000000476837158,
        "type": "fixed"
      }
    }
  },
  "manipulation": {
    "summary": "FetchRobot has a highly articulated arm with multiple degrees of freedom, including shoulder, elbow, and wrist joints that provide extensive workspace flexibility. The end-effector is a gripper (gripper_link) with two prismatic joints controlling the gripper fingers (r_gripper_finger_link and l_gripper_finger_link). This allows for precise gripping and manipulation of objects, facilitating tasks like pick-and-place from various locations including high shelves and under tables. The arm also includes an articulated agent arm camera for better perception during manipulation tasks.",
    "arm_workspace": {
      "type": "sphere",
      "center": [
        0.14739853143692017,
        0.899940013885498,
        0.1324108988046646
      ],
      "radius": 1.1041796
    }
  }
}