{
  "robot_id": "FetchRobot_arm_only",
  "robot_type": "FetchRobot",
  "mobility": {
    "summary": "Fetch has a wheeled base, consisting of two continuous joints connecting the right and left wheel links to the base link. This configuration allows the robot to move smoothly on flat surfaces typically found in indoor environments. However, the wheeled design limits its ability to navigate uneven terrain or climb stairs, making it unable to traverse between different floors autonomously without additional infrastructure such as ramps or lifts."
  },
  "perception": {
    "summary": "Fetch is equipped with an array of sensors to facilitate perception tasks. The primary sensor suite includes an RGB camera and a depth camera mounted on the head, offering a high vantage point due to the torso lift's prismatic joint. This configuration allows the robot to adjust its sensor height for optimal object detection and environment mapping. Additionally, there is a camera on the gripper link, providing a close-up view for fine manipulation tasks. However, the fixed nature of the head cameras restricts their field of view, necessitating head movements via pan and tilt joints to achieve comprehensive environmental perception.",
    "cameras_info": {
      "articulated_agent_arm_camera": {
        "height": 0.7860100000000001,
        "type": "articulated"
      }
    }
  },
  "manipulation": {
    "summary": "Fetch features a highly capable manipulator arm with multiple joints offering a high degree of freedom. The manipulator includes revolute joints at the shoulder (pan and lift), upper arm roll, elbow flex, forearm roll, wrist flex, and wrist roll, facilitating a wide range of movements. The end effector consists of a gripper with prismatic joints for the fingers, allowing precise grasping and manipulation of objects. The robot's design, combined with the lift mechanism of the torso, enables it to reach high shelves and low areas, making it suitable for tasks involving the rearrangement of furniture and objects across various heights within a home or similar setting.",
    "arm_workspace": {
      "center": [
        0.14739853143692017,
        0.899940013885498,
        0.1324108988046646
      ],
      "radius": 1.1041796,
      "min_bound": [
        -0.8757104873657227,
        -0.03437389060854912,
        -0.8868222236633301
      ],
      "max_bound": [
        1.0899982452392578,
        1.8497143983840942,
        1.1006197929382324
      ]
    }
  }
}