{
  "robot_id": "SpotRobot_default",
  "robot_type": "SpotRobot",
  "mobility": {
    "summary": "The robot 'spot' has significant mobility capabilities featured by a base connected to four legs. Each leg has three revolute joints (hip, upper leg, and lower leg), allowing for complex movements useful for navigating diverse terrains. This makes the robot capable of moving across different floor types and potentially handling multi-floor scenarios, which is critical for tasks like cross-floor object rearrangement."
  },
  "perception": {
    "summary": "The robot is equipped with two cameras: one fixed on the head and another on the arm's end-effector. The head camera is likely used for broader environmental awareness and navigation, while the arm camera provides detailed view necessary for precision tasks, such as identifying and manipulating objects. These cameras enable cooperative perception, allowing the robot to gather geometric information about objects for precise manipulation.",
    "cameras_info": {
      "articulated_agent_arm_camera": {
        "height": 0.5770000063180923,
        "type": "articulated"
      },
      "head_camera": {
        "height": 0.48,
        "type": "fixed"
      }
    }
  },
  "manipulation": {
    "summary": "The robot features a highly articulated arm with multiple revolute joints from the shoulder to the wrist and fingers. This arm has intricate joint configurations—seven revolute joints from the shoulder to the fingers—which enable a wide range of movements. The end-effector includes fingers, suggesting it has grasping capabilities. This combination makes the robot adept at tasks requiring detailed manipulation, such as picking and placing objects in various positions, and addressing objects in abnormal locations like high shelves or under tables.",
    "arm_workspace": {
      "center": [
        0.218833327293396,
        0.7876816987991333,
        0.18432271480560303
      ],
      "radius": 0.977087,
      "min_bound": [
        -0.6372385025024414,
        -0.03964763879776001,
        -0.6838088035583496
      ],
      "max_bound": [
        1.1124820709228516,
        1.5562466382980347,
        1.0395488739013672
      ]
    }
  }
}